artillery_test.yaml
config:
  target: 'http://127.0.0.1:8000'  # Замените на ваш адрес эндпоинта
  phases:
    - duration: 1  # Продолжительность теста в секундах
      arrivalRate: 100  # Количество запросов в секунду

scenarios:
  - flow:
      - get:
          url: '/gpt?prompt=%D0%9F%D1%80%D0%B8%D0%B2%D0%B5%D1%82%21'
          headers:
            accept: 'application/json'
            x-api-key: 'qwe'
          expect:
            - statusCode: 200
          maxResponseTime: 120000